УправлениеПаркомАттракционов/src/Catalogs/Клиенты/Клиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Клиенты</name>
  <attributes>
    <name>НормализованныйТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УправлениеПаркомАттракционов/src/Catalogs/Клиенты/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс
	
	Процедура ПеренестиТелефонВКонтактнуюИнформацию(ПараметрыОбработки) Экспорт
		
		ПараметрыОбработки.ОбработкаЗавершена=ложь;	
		
		ВидКИ=УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени("ТелефонКлиента");
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 50
			|	Клиенты.Ссылка
			|ИЗ
			|	Справочник.Клиенты КАК Клиенты
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Клиенты.КонтактнаяИнформация КАК КлиентыКонтактнаяИнформация
			|		ПО КлиентыКонтактнаяИнформация.Ссылка = Клиенты.Ссылка
			|		И КлиентыКонтактнаяИнформация.Вид = &ВидКИ
			|ГДЕ
			|	Клиенты.НормализованныйТелефон <> """"
			|	И КлиентыКонтактнаяИнформация.Ссылка ЕСТЬ NULL";
		
		Запрос.УстановитьПараметр("ВидКИ",ВидКИ);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			ПараметрыОбработки.ОбработкаЗавершена=истина;
			Возврат;
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СпрОбъект=ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			
			НовКонтИнф=УправлениеКонтактнойИнформацией.НоваяКонтактнаяИнформация();
			СтрокаКИ=НовКонтИнф.Добавить();
			СтрокаКИ.Вид=ВидКИ;
			СтрокаКИ.Представление=СпрОбъект.НормализованныйТелефон;
			СтрокаКИ.Объект=СпрОбъект;
			
			УправлениеКонтактнойИнформацией.УстановитьКонтактнуюИнформациюОбъекта(СпрОбъект,НовКонтИнф,ложь);
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СпрОбъект);
			
//			НачатьТранзакцию();
//			Попытка
//				СпрОбъект=ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
//				ДанныеФото=СпрОбъект.УдалитьФото.Получить();
//				Если ДанныеФото<>Неопределено Тогда
//					ПеренестиФотоВПрисоединенныйФайл(СпрОбъект,ДанныеФото);					
//				КонецЕсли;
//				СпрОбъект.ФотоПеренесено=истина;
//				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СпрОбъект);
//				ЗафиксироватьТранзакцию();	
//			Исключение
//				ОтменитьТранзакцию();
//				ВызватьИсключение;
//			КонецПопытки;
		КонецЦикла;
				
	КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти

#КонецЕсли
